app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "email", "encrypted_password", "remember_token") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = user_from_params
    @user.email_confirmation_token = Clearance::Token.new

    if @user.save